Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: རེག་པ་དང་ཚོར་བ་ལ་རྗེས་སུ་གདུངས་པས་དེ་ཡུལ་ལ་སྲེད་པའི་བཟོད་པ་ཡོངས་སུ་སྤངས་པའོ། །རྣམ་པར་འཇིག་པའོ། །
en: The torment that follows contact and feelings leads to destroying and completely abandoning acceptance in regard to the craving for objects.

source: ཡིད་ལ་རྣམ་པར་དམིགས་པས་འདུ་ཤེས་ཀྱི་ཞིང་ལ་སྲེད་པའི་བཟོད་པ་ཡོངས་སུ་སྤངས་པའོ། །འཁྲུག་པའོ། །
en: Fixating on the mental faculty leads to confusion and completely abandoning the acceptance in regard to the craving for the realm of perceptions.

source: དུས་གསུམ་དང་། འདུ་བྱེད་གསུམ་ལ་ཉེ་བར་ཆད་པའི་ཡུལ་ལ་སྲེད་པའི་བཟོད་པ་ཡོངས་སུ་སྤངས་པའོ། །འཁྲུག་པའོ། །
en: There is discord and one completely abandons the acceptance in regard to the craving for objects, which brings an end to the three times and the three types of formations.

source: འདུ་བྱེད་གསུམ་དག་མཚན་མར་ཉེ་བར་འཛིན་པ་དང་། རང་གི་ཡུལ་གྱི་སྲེད་པའི་བཟོད་པ་ཡོངས་སུ་སྤངས་པའོ། །
en: One holds fast to the marks of the three types of formations, completely abandons the acceptance related to craving for objects, and gets into arguments.

source: འཁྲུག་པའོ། །འདུ་བྱེད་དག་ཀུན་ནས་ལྡང་ལ་དམིགས་པ་རང་གི་ཡུལ་ལ་སྲེད་པའི་བཟོད་པ་ཡོངས་སུ་སྤངས་པ་ནི་ཆོས་ཀྱི་དབྱིངས་ལ་ཅིའང་མ་ཡིན་པའི་ཉོན་མོངས་པའི་བཟོད་པ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་པའོ། །
en: Apprehending formations that have completely arisen, and completely abandoning the acceptance related to craving for objects, is the complete abandonment of any form of acceptance of the fact that there are no afflictions whatsoever in the realm of phenomena.

source: རིགས་ཀྱི་བུ་ཆོས་ཀྱི་དབྱིངས་ལ་ཀུན་ཏུ་ཉོན་མོངས་པ་མེད་པའི་བཟོད་པ་དེ་སྒོམ་པ་དང་། རྣམ་པར་ཤེས་པའི་ལུས་དྲུག་གི་ཡུལ་དུ་ཡིད་ལ་མི་བྱེད་དོ། །
en: Noble son, bodhisattvas cultivate the acceptance of the realm of phenomena devoid of afflictions and do not focus on the objects of the six collections of consciousness.

source: དེ་བཟོད་པ་བསྒོམས་པའི་རང་བཞིན་དང་། སྒྱུ་མ་ལྟ་བུའི་སེམས་ཀྱི་ཡུལ་ལ་ཡང་དག་པར་གཞོལ་བས་ཡུལ་ཐམས་ཅད་ལ་རྟོག་པར་འགྱུར་རོ། །
en: This is the nature of cultivating acceptance, and it leads one to think about all objects as the coming together in the sphere of thought of entities that are like illusions.

source: དེ་ལ་སོ་སོ་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་གྱི་བཟོད་པ་བསྒོམས་པས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་ལས་ལ་བརྩོན་པར་བྱའོ། །གང་ཡང་བྱང་ཆུབ་སེམས་དཔས་རྣམ་པར་དབྱེ་བ་ཡོངས་སུ་བྱས་པ་དང་།
en: “In this way, those who cultivate acceptance through individual methods of perfect conduct should exert themselves in the previous actions of the bodhisattvas.

source: མཆོག་གི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་ལྡང་བ་འདི་ནི་ནམ་མཁའ་ལ་འགྲོ་བས་འདུལ་བའི་བཟོད་པ་ཡོངས་སུ་རྒྱས་པར་བསྒོམ་པའི་ཕྱིར་འདི་ནི་དུས་གསུམ་དང་། འདུ་བྱེད་ཐམས་ཅད་ཀྱི་ཡུལ་དུ་ཡིད་ལ་མི་བྱེད་དོ། །
en: When bodhisattvas have carried out a detailed analysis and the root of supreme virtue has completely arisen, they move throughout space and do not focus their attention on, or become conceited about, the three times or all manner of formations.

source: སྙེམས་པ་མེད་དོ། །
en: In this way, their cultivation of acceptance of discipline will expand.

source: དུས་གསུམ་དང་། འདུ་བྱེད་ཐམས་ཅད་དག་ཀུན་ནས་ལྡང་བའི་ལམ་ཐམས་ཅད་དུ་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཡང་དག་པར་སྤྱོད་དོ། །
en: One may practice the mental consciousness correctly on any path in which the three times and all of the formations have fully arisen.

source: དེ་བཞིན་ཉིད་ནི་དངོས་པོ་མེད་པའོ། །
en: Suchness is insubstantial.

source: དུས་གསུམ་དང་། འདུ་བྱེད་ཀྱི་རྗེས་སུ་འཇུག་པ་དང་། ཆོས་ཐམས་ཅད་མི་བསྒོམ་པར་རབ་ཏུ་ཤེས་པ་དང་།
en: Bodhisattvas understand that they should not engage with the three times and formations or cultivate any and all such phenomena.

source: བསྒོམ་པ་དང་བྲལ་བ་དང་། དབྱངས་མ་ཡིན་པ་དང་། ངག་གི་ལམ་མ་ཡིན་པ་དང་། ཡི་གེ་མ་ཡིན་པ་དང་།
en: They know that they are free from cultivation and are without tone, without language, and wordless.

source: རྗེས་སུ་འབྱུང་བ་མེད་པ་དང་། འགོག་པ་མེད་པ་དང་། མཚན་ཉིད་མེད་པ་དང་།
en: They know that they do not arise, do not cease, and have no characteristics.

source: སོ་སོའི་ཐེག་པ་མ་ཡིན་པ་དང་། དམིགས་པ་མེད་པ་དང་། མཚན་མ་མེད་པ་དང་། ཤིན་ཏུ་དབེན་པ་མ་ཡིན་པ་དང་། བརྗོད་པ་མེད་པ་དང་། ཤིན་ཏུ་འཇུངས་པ་མེད་པ་དང་།
en: They know that they are not the different vehicles, they are not apprehended, they are without marks, and they are not completely isolated.

source: ཤིན་ཏུ་ཞི་བ་དང་། སྐད་ཅིག་མར་ཤིན་ཏུ་དམིགས་པས་རྣམ་པར་བྲལ་བ་དང་། ཤིན་ཏུ་ཟད་པ་དང་། ཀུན་གཞི་ལས་ཤིན་ཏུ་བྲལ་བ་དང་། ཤིན་ཏུ་རྣམ་པར་གནས་པ་དང་། ཡུལ་ཤིན་ཏུ་མེད་པ་དང་། གཏོང་བའི་སེམས་ཤིན་ཏུ་མེད་པ་དང་། རྩ་བ་ཤིན་ཏུ་མེད་པ་དང་།
en: They know that they are inexpressible, without avarice, utterly peaceful, free from momentary apprehension, utterly extinguished, groundless, utterly tranquil, utterly devoid of object, utterly without beneficence, and completely rootless.

source: དབང་པོ་ཤིན་ཏུ་མ་ཡིན་པ་དང་། ཤིན་ཏུ་རྣམ་པར་མ་དག་པ་དང་། ཤིན་ཏུ་བྲལ་བ་དང་། གཉེན་པོ་ཤིན་ཏུ་མེད་པ་དང་། མཚན་མ་དང་དངོས་པོ་མེད་པ་དང་།
en: They know that they are not the sense faculties, they are utterly impure, and they are completely separate, utterly without antidote, devoid of marks and insubstantial, not at all stolen, utterly diffuse, and utterly insubstantial with respect to all phenomena.

source: ཤིན་ཏུ་འཕྲོག་པ་མེད་པ་དང་། ཤིན་ཏུ་འཐོར་བ་དང་། ཆོས་ཐམས་ཅད་ལ་ཤིན་ཏུ་དངོས་པོ་མེད་པར་རབ་ཏུ་ཤེས་པ་ནི་བྱེད་པ་པོ་མེད་པ་དང་། ཚོར་བ་པོ་མེད་པ་དང་། ཉན་པ་མེད་པ་དང་།
en: On this understanding, there is no agent, no subject who feels, no hearing, and there is no apprehender.

source: འཛིན་པ་མེད་པ་དང་། སྨིག་རྒྱུ་བ་ལྟ་བུར་སོ་སོར་སྣང་བ་དང་། ཆུ་ཟླ་ལྟ་བུ་དང་། གཟུགས་བརྙན་ལྟ་བུ་ནམ་མཁའི་རང་བཞིན་ཆུང་ཟད་ཀྱང་མེད་པ་དང་།
en: Individual appearances are like a mirage, like the moon’s reflection in water, and like a reflected image; they have the nature of space and are utterly nonexistent.

source: ཆོས་ཐམས་ཅད་ལ་བདག་མེད་པ་ནི་མཚན་ཉིད་ཀྱི་གཞི་དང་མཉམ་པའི་མཚན་ཉིད་དང་།
en: All phenomena lack a self.

source: མཚན་ཉིད་གཅིག་པ་དང་།
en: This is the basis of their defining characteristic, the characteristic they have in common, their single characteristic, and bodhisattvas regard all things as grounded in the absence of a defining characteristic.

source: མཚན་ཉིད་མེད་པ་ལ་བརྟེན་པ་དེ་ཆོས་ཐམས་ཅད་ལ་ཀུན་དུ་ལྟའོ། །དེ་ལྟར་ཤིན་ཏུ་འདུ་བྱེད་ཐམས་ཅད་ནི་དེ་བཞིན་དུ་དུས་གསུམ་ལ་ཀུན་ཏུ་སྤྱོད་པའི་དངོས་པོ་དེའི་བར་དུ་ཆོས་ཐམས་ཅད་ལ་དེ་བཞིན་ཉིད་དུ་རྟེན་པ་ལ་ཀུན་ཏུ་ལྟའོ། །
en: They regard all phenomena, including all the formations and everything that is experienced in the three times, as grounded in suchness.

source: འདི་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཉེ་བར་འཚོ་བས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་རྒྱས་པ་ནི་སོ་སོ་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའ་ལ་འགྲོ་བའི་འོད་ཀྱིས་འདུལ་བའི་བཟོད་པར་བལྟ་བར་བྱའོ། །
en: Moreover, since the nourishment given by the bodhisattvas spreads to all beings, this should be regarded as the acceptance that tames beings with light that travels throughout space.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་དུ་གཟུགས་ཀྱི་བཟོད་པ་བསྒོམ་པའི་ཕྱིར་ཕྱི་ནང་གི་འཇམ་པ་དབུང་ཙམ་ཐམས་ཅད་ཀྱིས་ཉོན་མོངས་པ་རྣམ་པར་སེལ་བར་ཐམས་ཅད་དུ་སེམས་པ་དང་། ཡིད་བཞིན་ཡོངས་སུ་རྒྱས་པར་འགྱུར་རོ། །
en: “Noble son, bodhisattvas clear away afflictions in that way in order to cultivate the acceptance related to forms whenever they gently breathe in and out, and their thoughts and wishes for all beings reach full bloom.

source: འདི་ལ་བཟོད་པ་ཐམས་ཅད་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཆོས་ལས་ཀུན་ཏུ་འདས་པའོ། །
en: All those acceptances completely transcend the qualities of the hearers and solitary buddhas.

source: འདི་ལ་བཟོད་པ་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཡོན་ཏན་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: All those acceptances perfect the qualities of bodhisattva conduct.

source: འདི་ལ་བཟོད་པ་ཐམས་ཅད་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་ཡོན་ཏན་ཀུན་ནས་སྡུད་དོ། །
en: All those acceptances gather all the qualities of the teachings of the buddhas.

source: འདི་ལ་བཟོད་པ་ཐམས་ཅད་ནི་གཞན་གྱི་རྒོལ་བའི་ཆོས་དང་ལྷན་ཅིག་པར་འཛིན་ཏོ། །
en: All those acceptances are understood along with the teachings for which other traditions argue.

source: འདི་ལ་བཟོད་པ་ཐམས་ཅད་ནི་གཏི་མུག་གི་མུན་པ་མུན་ནག་འཇིག་པའི་ཡིད་དོ། །སངས་རྒྱས་ཀྱི་ཆོས་ལ་དགའ་བར་བྱེད། བསྒྲིབས་པ་དང་།
en: All those acceptances are mindsets that destroy the dense darkness of ignorance.

source: སྒྲིབ་པ་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་དེ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྣང་བར་བྱེད། སངས་རྒྱས་ཐམས་ཅད་ལ་དད་པར་བྱེད། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་འགྲོ་བ། མངོན་པར་ཤེས་པ་ཐམས་ཅད་ལ་རྣམ་པར་རོལ་པར་བྱེད་པ།
en: They induce delight in the teachings of the buddhas, they eliminate all obscurations and hindrances, they illuminate all the buddha realms, they instill faith in all the buddhas, they are the perfection of all the perfections, they revel in all the supernormal faculties, and they make one achieve the acceptance of absorptions and dhāraṇīs.

source: ཏིང་ངེ་འཛིན་གྱི་གཟུངས་ཀྱི་བཟོད་པ་སྒྲུབ་པར་བྱེད་པ་འདི་ནི་སོ་སོར་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའ་ལ་འགྲོ་བའི་འོད་ཀྱིས་འདུལ་བའི་བཟོད་པའོ། །
en: This is the acceptance that tames beings with light that travels throughout space by means of various methods of perfect conduct.”

source: དེ་ལ་ཡང་དྲང་སྲོང་ཐུབ་པ་ལ་སོ་སོར་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའ་ལ་འགྲོ་བའི་འོད་ཀྱིས་འདུལ་བའི་བཟོད་པ་བརྗོད་པ་དང་། འཆད་པ་ནི་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་ཀྱི་ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་ཀྱི་ཕྱོགས་བཅུའི་ཁུང་བུར་མཉམ་པར་འགྲོ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་གོམས་པས་སོ་སོར་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའ་ལ་འགྲོ་བའི་འོད་ཀྱིས་འདུལ་བའི་བཟོད་པ་སོ་སོར་ཐོབ་པར་འགྱུར་རོ། །
en: As the acceptance that tames beings with light that travels throughout space using each method of perfect conduct was being proclaimed and explained before the sage Seer, that bodhisattva’s repeated instruction led each and every being equal to the number of pores of all the beings in the ten directions, who are as numerous as all the grains of sand in 6,800,000 Ganges Rivers, to achieve the acceptances of taming beings with light that travels throughout space using each method of perfect conduct.

source: བྱང་ཆུབ་སེམས་དཔའ་མེ་བཅུ་རྡུལ་ཡལ་སུམ་ཅུ་རྩ་གཅིག་གི་ཏིང་ངེ་འཛིན་གྱི་སྐར་མདའི་བདག་པོ་སོ་སོར་ཐོབ་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་ས་ཡ་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་རྣམས་དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་སོ་སོར་ཐོབ་པར་འགྱུར་རོ། །
en: Thirty-one myriads of bodhisattvas each attained the lord of meteors absorption; 92,000,000 bodhisattvas each achieved the proceeding as a hero absorption.

source: བྱང་ཆུབ་སེམས་དཔའ་མདོར་ན་དེའི་བར་དུ་ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་ཀྱི་བར་དུ་རྣམ་པ་སྣ་ཚོགས་དང་། རྣམ་པ་ཐ་དད་པ་ཐམས་ཅད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་གཟུངས་ཀྱི་བཟོད་པའི་ཆོས་ཀྱི་སྒོ་སོ་སོར་ཐོབ་པར་འགྱུར་རོ། །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་སྔགས་ཀྱི་ཚིག་འདི་བརྗོད་དོ། །པྲ་མ་ཏ་ཏེ། བིཛྲཱྀམ་བྷ་ཨུཏ་པཏ་ཏེ། ཨུཏ་པཏ་ཏ།
en: In short, as many bodhisattvas as there are grains of sand in the Ganges each achieved the gateway to the Dharma of acceptance of all manner of various and distinct dhāraṇīs and absorptions.

source: ཨུད་མ་ཏ་ཏེ། ཛ་སམ་བིཛྲཱྀམ་བྷ་སྭཱ་ཧཱ། ལྷ་ས་ཡ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་བརྒྱད་འདིས་སོ་སོར་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའ་ལ་འགྲོ་བའི་འོད་ཀྱིས་འདུལ་བའི་བཟོད་པ་སོ་སོར་ཐོབ་པར་འགྱུར་རོ། །ཆུ་བོ་གང་གཱའི་བྱེ་མ་དང་མཉམ་པའི་ལྷ་རྣམས་ཀྱིས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སོ་སོར་ཐོབ་པར་འགྱུར་རོ། །ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་སྔགས་འདི་བརྗོད་དོ། །ཏད་ཡ་ཐཱ། ས་མུ་དྲ་བ་ཏེ། མ་རུ་བ་ཏེ་ན་པི་ནི།
en: The Blessed One then uttered the words of this mantra: pramadate vijṛmbha utpatate utpatata utmatate jaḥ samvijṛmbha svāhā | Ninety-eight sextillion gods each achieved the acceptance taming beings with light that travels through space using the perfect method of conduct for each one, and gods as numerous as all the grains of sand in the Ganges each attained irreversible awakening.

source: ན་པི་ནི། གཽ་ར་བེ་ཥ་དེ་ནི་ཥ་དེ་ནི། ཨི་བི་ཛ་སོ་ཧ་ཛ་བྷི་བྷེ་ད་སང་སྐ་རཱ་བྷྲ་སྭཱ་ཧཱ། ས་ཡ་ཕྲག་བདུན་ཅུ་རྩ་བདུན་གྱི་ཀླུ་རྣམས་ལ་འདི་དག་བཤད་པ་འཆད་པས་བཟོད་པ་སོ་སོར་ཐོབ་པར་འགྱུར་རོ། །ཆུ་བོ་གང་གཱའི་བྱེ་མ་དང་མཉམ་པའི་ཀླུ་རྣམས་ཀྱིས་བྱང་ཆུབ་ཀྱིས་ཕྱིར་མི་ལྡོག་པ་སོ་སོར་ཐོབ་པར་འགྱུར་རོ། །
en: The Blessed One then uttered the words of this mantra: tadyathā | samudravate maruvate napini napini gauraveṣa deniṣadeni ivijasoha jabhiibheda saṅskarābhra svāhā | As those words were being uttered, 77,000,000 nāgas each achieved this acceptance, and nāgas as numerous as all the grains of sand in the Ganges attained irreversible awakening.

source: དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་སྔགས་ཀྱི་ཚིག་འདི་བརྗོད་དོ། །ཏད་ཡ་ཐཱ། ཛ་ན་མི་བྷཱ་བ་སུ་བྷཱ་བ་སུ་བྷཱ་བ་སུ་བྷཱ་བོ། བྷ་བ་བོ། བྲ་བོ་བ་བ་ཁ། ག་བ་ཨ་ཁ་ག་བ་བི་བྷ་ཛ་ཡ་བྷྱོ་སྭཱ་ཧཱ། ས་ཡ་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་གཉིས་ཀྱི་གནོད་སྦྱིན་རྣམས་ལ་བཤད་པ་འཆད་པས་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་འཇུག་པར་འགྱུར་རོ། །
en: The Blessed One then uttered the words of this mantra: tadyathā | janami bhāva subhāva subhāva subhāvo bhavavo bravovavakha gavākha gava vibhajayabhyo svāhā | As those words were being uttered, 22,000,000,000 yakṣas entered the level of nonregression.

source: སྟོང་ཕྲག་བརྒྱའི་གནོད་སྦྱིན་རྣམས་ཚད་མེད་པ་ཕྱིར་མི་ལྡོག་པའི་ས་ཐོབ་པར་འགྱུར་རོ། །བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་ལྷ་མ་ཡིན་རྣམས་ཚད་མེད་པ་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་ཞུགས་སོ། །ས་ཡ་ཕྲག་བརྒྱ་སྟོང་གི་ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཚད་མེད་པ་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་འཇུག་པར་འགྱུར་རོ། །
en: One hundred thousand yakṣas reached the level of immeasurable nonregression, myriads of asuras entered the level of immeasurable nonregression, and a hundred billion garuḍas, kinnaras, and mahoragas also entered the level of immeasurable nonregression.

source: འདི་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་འཆད་པ་བཤད་ནས་ཕྱོགས་བཅུ་མཐའ་ཡས་པའི་ས་ཆེན་པོ་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །ལྷ་བྲན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་ཚད་མེད་གྲངས་མེད་པ་རྣམས་ནམ་མཁའ་ལས་ལྷ་རྫས་ཀྱི་མེ་ཏོག་གི་ཆར་འབེབས་སོ། །
en: After the Blessed One had uttered those words, the boundless great earths of the ten directions shook in six ways, and countless myriads of divine beings rained showers of divine flowers from the sky.

source: གང་ཕྱོགས་བཅུ་ཚད་མེད་གྲངས་མེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་དེ་འོངས་ཤིང་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པའི་འཁོར་ཐམས་ཅད་དང་ལྡན་པ་དེ་ཡང་དག་པར་འོངས་ནས། དེ་ཐམས་ཅད་ཀྱིས་དབྱངས་གཅིག་ཏུ་ལེགས་སོ་ཞེས་བྱ་བ་བྱས་ཏེ།
en: All the assemblies of gods, nāgas, yakṣas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans who had arrived in this buddha realm from countless myriads of buddha realms in the ten directions applauded in unison, and exclaimed, “Excellent, excellent!

source: དེ་བཞིན་དུ་ཚིག་འདི་རྗོད་པར་བྱེད་དོ། །ལེགས་སོ་ལེགས་སོ། །བཅོམ་ལྡན་འདས་ལུས་ཐམས་ཅད་རྣམ་པར་འཇིག་པ་དང་། ཡུལ་ཐམས་ཅད་རབ་ཏུ་འཇིག་པའི་བཟོད་པ་བཤད་པ་དང་། གཞན་ལ་རག་མ་ལས་པ་བདུད་བཞིའི་ཆོས་ཀྱི་བཟོད་པ་ལྷག་པར་བཤད་པ་ངོ་མཚར་ཆེན་པོ་འདི་སྔོན་མ་ཐོས་སོ། །
en: Blessed One, this explanation of acceptance of the fact that all bodies disintegrate and all sense objects disintegrate, and this exceptional exposition of the acceptance of the fact that the qualities of the four māras do not depend on anything else, is a great wonder that has never been heard of before!

source: འདི་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་གི་སྤྱོད་པ་དང་། བྱ་བའི་གནས་ཀྱིས་ལས་ཤིན་ཏུ་འདས་པའི་ཚོགས་འདྲེན་པར་བྱེད་དོ། །
en: It leads to the conduct of the bodhisattva great beings and the accumulation of surpassingly excellent deeds at the places they are to be done.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་རིན་པོ་ཆེའི་གཏེར་ཐམས་ཅད་ཐོབ་པར་བྱེད་པའི་བཟོད་པ་སྟོན་པ་དང་།
en: It reveals the acceptance that makes one obtain the entire precious treasure of the thirty-seven factors of awakening.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐམས་ཅད་ཤེས་པར་བྱེད་པ་དང་།
en: It makes one realize all forms of omniscient wisdom.

source: རྣམ་པ་ཐམས་ཅད་ཀྱི་བཟོད་པ་བསྒོམ་པ་འདི་བཤད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བརྗོད་དུ་མེད་པའི་དོན་སྙིང་རྗེ་ཆེན་པོ་ཐོབ་པ་ལ་འཇུག་གོ། །
en: Explaining this cultivation of the acceptance of all aspects causes beings to attain great compassion—the inexpressible goal of the bodhisattva great beings.

source: ཐབས་ལ་མཁས་པ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པའི་ཡེ་ཤེས་ཆེན་པོ་ཀུན་ཏུ་བསགས་པའི་བརྩོན་འགྲུས་དང་། སྟོབས་ཀྱི་བཟོད་པ་རབ་ཏུ་བསྟན་ཏོ། །
en: It reveals the acceptance related to diligence and power by which one accumulates skillful means and great wisdom that ripens all beings.”

source: སོ་སོར་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའ་ལ་འགྲོ་བའི་འོད་ཀྱིས་འདུལ་བའི་བཟོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་ལེའུ་དྲུག་གོ།། །།
en: This was the sixth chapter of the Great Vehicle sūtra entitled “The Acceptance That Tames Beings with Light Rays That Travel through Space and the Method of Perfect Conduct for Each One.”

source: དེ་ནས་དེ་ཉིད་ཀྱི་ཚེ་ན་ཤཱཀྱ་ཐུབ་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་སྐར་མདའ་ཉི་ཤུ་བའི་རྒྱུན་བཅད་དེ། དེ་བཞིན་གཤེགས་པའི་གཟུགས་སུ་བརྩམས་ནས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: Chapter 7 At that moment, the thus-gone one, the worthy, perfect, and completely awakened Buddha Śākyamuni, interrupted his absorption of the twenty meteors, adopted the form of a thus-gone one, and taught the Dharma to the beings.

source: ལྷ་དང་། དྲི་ཟ་དང་། མིའི་འཁོར་དེ་ཐམས་ཅད་དང་ལྡན་པ་དེ་ཇི་ལྟ་བུར་སྔོན་གྱི་གཟུགས་ཀྱི་ལུས་ཀྱིས་གནས་པར་གྱུར་ཏོ། །
en: All the assemblies of gods, gandharvas, and humans also recovered their previous physical appearances.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཡང་འཁོར་བའི་དཀྱིལ་འཁོར་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་བཞག་སྟེ། ཡང་བཅོམ་ལྡན་འདས་འཁོར་བའི་དཀྱིལ་འཁོར་གྱི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་ཞུགས་མ་ཐག་ཏུ་དེ་ནས་དེ་ཉིད་ཀྱི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་ནས་ཁ་དོག་དུ་མ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་འོད་ཟེར་བྱུང་སྟེ།
en: The Blessed One then entered the absorption known as the circle of saṃsāra, and as soon as he entered the circle of saṃsāra absorption, multicolored light rays radiated from the coil of hair between his eyebrows.

source: འོད་ཟེར་དེས་ཕྱོགས་བཅུ་ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་ཀྱི་རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་ཀུན་སྣང་བར་བྱས་སོ། །
en: The light rays illuminated the followers of the vehicle of the solitary buddhas in the buddha realms of the ten directions, numerous as all the grains of sand in the Ganges and inundated with the five impurities.

source: ཇི་ལྟར་སེམས་ཅན་རྣམས་འོད་ཟེར་དེ་ལུས་ལ་རེག་པ་དེ་ལྟར་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་ཀུན་གཞི་སྤངས་པས་དེ་ཡང་དེ་ལྟར་ལུས་ཀྱི་གཟུགས་བདེ་བ་དང་ལྡན་པར་འགྱུར་རོ། །
en: As the bodies of those beings were touched by those light rays, they abandoned the fundamental ground of attachment, anger, and delusion, and their bodies became filled with bliss.

source: འདི་ལྟ་སྟེ། དཔེར་ན། བསམ་གཏན་གཉིས་ལ་ཡང་དག་པར་ཞུགས་པའི་དགེ་སློང་དག་དེ་ཡང་ཕྱོགས་བཞིའི་རྣམ་པར་སྣང་བའི་ཕྱིར་བདག་གང་དུ་རྣམ་པ་འདི་འདྲ་བའི་བདེ་བ་དང་། ཚོར་བ་འབྱུང་བར་འགྱུར་བ་དེ་ཡང་སངས་རྒྱས་ཀྱི་མཐུས་ན།
en: Because of that light illuminating the four directions, they experienced the same levels of bliss and the same feelings as monks who have entered the second level of concentration.

source: དཔག་ཚད་ཕྱེད་ཙམ་ན་ཤཱཀྱ་ཐུབ་པ་དེ་བཞིན་གཤེགས་པ་འཁོར་དང་བཅས་པ་མི་རིང་བར་མཐོང་ངོ་། །
en: Through the power of the Buddha, they saw that the Thus-Gone One Śākyamuni and his assembly were not far away from them—approximately half a league away.

source: མཆོག་ཏུ་དང་བ་ཐོབ་པ་དེ་སངས་རྒྱས་ཀྱི་མཐུས་ཆུང་ཟད་ཙམ་གྱིས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་ཉེ་བར་ཕྱིན་ཏོ། །
en: They had intense faith, and solely through the power of the Buddha, they came before the Blessed One.

source: དེ་ནས་དེའི་དུས་ན་ཡང་ཕྱོགས་བཅུའི་རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་མེ་བཅུ་རྡུལ་ཡལ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིའི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའི་སེམས་ཅན་འདི་དག་དེ་ལྟར་ཤཱཀྱ་ཐུབ་པ་དེ་བཞིན་གཤེགས་པའི་དྲུང་དུ་ཉེ་བར་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཆོས་མཉན་པའི་ཕྱིར་འདུག་གོ། །
en: The buddha fields of the ten directions that are inundated with the five impurities emptied, and eighty-four thousand myriads of beings following the vehicle of the solitary buddhas arrived before Śākyamuni, prostrated at the Blessed One’s feet, and sat before him to listen to the Dharma.

source: དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གདུལ་དཀའ་བ་བོས་སོ། །ཡུལ་ལ་ཆགས་པའི་རིགས་ཀྱི་བུ། །རྟག་ཏུ་དགའ་བའི་བྱ་བ་བྱེད། །ཤིན་ཏུ་ཤེས་མེད་བྱིས་པ་དག །བདེ་བའི་ལམ་དུ་དེ་མི་ཤེས། །
en: The Blessed One then summoned the bodhisattvas who were hard to tame: “Noble sons, foolish beings attached to objects Constantly engage in activities of pleasure, Are completely without understanding, And do not know the path leading to happiness.

source: མུན་པའི་ཕུང་པོས་དེ་གཡོགས་སོ། །འཁོར་བ་ཡང་ནི་མི་འདོར་རོ། །ཆུང་བའི་འདུ་བྱེད་སྤྱོད་ཡུལ་ལ། །འདོད་པའི་ཡོན་ཏན་ལྔ་ལ་ཞེན། །
en: “They are covered by dense darkness, They do not cast off saṃsāra, And they cling to the realm of lesser formations And the five sense pleasures.

source: དེ་དག་ཚེ་ཡང་མངོན་པར་འདོད། །དུག་གི་ཆུ་ཡང་དེ་ལྟར་འཐུངས། །
en: “Their life is one of intense craving, And they drink from its poisoned waters.

source: སྡུག་བསྔལ་ཚོར་བ་རྗེས་སུ་མྱོང་། །འཁོར་བ་ལ་ཡང་མངོན་པར་འདོད། །
en: They experience the reeling of suffering Yet they have an intense craving for saṃsāra.

source: ཤ་དང་ཁྲག་ལ་ཡང་ནི་ཟ། །འཁོར་ལོ་དེ་ལྟར་རྣམ་པར་གནས། །ཡང་དང་ཡང་དུ་འཁོར་བ་ནི། །མི་ཟད་ཡོན་ཏན་དུ་ནི་ཤེས། །
en: “They feed on flesh and blood And remain within that wheel, Circling again and again, Without understanding its inexhaustible quality.

source: ལོངས་སྤྱོད་རྙེད་མེད་མི་ཟད་པ། །འདི་ལ་གཏེར་གྱི་མཐའ་ཡང་མེད། །
en: “Here, wealth is neither gained nor exhausted, And treasures have no limit.

source: མི་དགེ་མཛའ་བོ་སྤངས་པ་ནི། །མཚོན་པའི་སྡུག་བསྔལ་རབ་ཏུ་ཞི། །
en: Abandoning nonvirtuous friends Completely pacifies the suffering associated with marks.

source: བཟོད་པ་བསྒོམ་ལ་མཁས་པ་ནི། །ཉོན་མོངས་ཐམས་ཅད་རབ་ཏུ་ཞི། །སྲོག་ཆགས་བྱེ་བ་འདུལ་བྱེད་པ། །གཏེར་བཞི་ཡང་ནི་ཐོབ་པའོ། །
en: “Those who are skilled in cultivating acceptance Completely pacify all the afflictions, Tame millions of living beings, And obtain the four treasures.

source: སེམས་ཅན་སྡུག་བསྔལ་བདེ་བར་བཀོད། །དེ་ནི་ཆུ་ཟླ་འདྲ་བར་འགྱུར། །
en: “They establish suffering beings in happiness, And they are like reflections of the moon in water.

source: འགྲོ་བའི་མཆོག་ནི་མྱ་ངན་འདས། །དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སྤོས་ཤེས་པས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས། རིགས་ཀྱི་བུ་ཕོའམ།
en: Foremost among beings, they pass into nirvāṇa.”

source: རིགས་ཀྱི་བུ་མོ་དག །མི་འཇིགས་པའི་ལོངས་སྤྱོད་སོ་སོར་ཐོབ་བམ། མི་འཇིགས་པའི་བསོད་ནམས་དང་། མི་ཟད་པའི་ཤེས་རབ་དང་། མི་ཟད་པའི་སྤོབས་པ་སོ་སོར་ཐོབ་བམ་ཞེས་དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: The bodhisattva Skilled in Fragrances then asked the Blessed One, “Blessed One, will each of those noble sons and daughters obtain an abundance of fearlessness, and will each of them obtain the merit of fearlessness, inexhaustible insight, and inexhaustible eloquence?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སྤོས་ཤེས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གང་རིགས་ཀྱི་བུ་ཕོའམ། རིགས་ཀྱི་བུ་མོ་སུ་ཞིག་འདུ་བྱེད་ཐམས་ཅད་ལ་མི་འགྲོ་བ་དང་མི་འཛིན་པར་ཤེས་པ་དེ་ལྟར་འདུ་བྱེད་ཐམས་ཅད་ལ་བདག་པོ་དང་། རྒྱུ་དང་རྐྱེན་མེད་པ། མི་སྒྲུབ་པ།
en: The Blessed One replied to the bodhisattva Skilled in Fragrances, “Noble sons and daughters who understand not to pursue or cling to any formations regard all formations as without an owner, without causes and conditions, unestablished, and devoid of an agent.

source: བྱེད་པ་ཉེ་བར་ལྟ་བར་འགྱུར་རོ། །དེ་ལ་དངོས་པོ་མེད་པའི་ཆོས་ཡོད་པ་དེ་འདུ་བྱེད་ཐམས་ཅད་ལ་རྟོག་པ། རྣམ་པར་རྟོག་པ། མཚན་མར་འཛིན་པ་མ་ཡིན་པར་འགྱུར། དཔེ་བྱད་བཟང་པོས་མ་ཡིན།
en: They do not cling to the thoughts, concepts, or marks of all those formations, which are insubstantial, or to the excellent minor marks.

source: འཇིག་རྟེན་ལ་ཆུང་ཟད་ཀྱང་འཛིན་པ་མ་ཡིན། གཟུགས་ལ་འཛིན་པ་མ་ཡིན།
en: They do not cling to the world in any way whatsoever.

source: དེ་ནི་སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་ལ་འཛིན་པ་མ་ཡིན། འདོད་པའི་ཡོན་ཏན་ལྔ་ཉེ་བར་མི་ལེན།
en: They do not cling to forms, sounds, smells, tastes, or tactile objects, and they do not grasp at the five sense pleasures.

source: སྲིད་པ་ཐམས་ཅད་སྐྱེ་བ་མ་ཡིན།
en: They will not be reborn in any state of existence.

source: གང་ཆགས་པ་དང་བྲལ་བ་ཐམས་ཅད་སྐྱེ་བ་མ་ཡིན།
en: All those who are free from attachment will not be reborn.

source: དེ་དངོས་པོ་མ་ཡིན། ཡིད་ལ་བྱེད་པ་མ་ཡིན།
en: They are insubstantial and lack mental engagement.

source: གང་དངོས་པོ་མེད་པ་དང་། ཡིད་ལ་མི་བྱེད་པ་དེ་ནི་ཆགས་པ་མེད་པའོ། །
en: Those who are insubstantial and lack mental engagement are devoid of attachment.

source: གང་ཆགས་པ་མེད་པ་དེ་ནི་ཡི་གེ་དང་བྲལ་བའོ། །
en: Those who are devoid of attachment are free from words.
